// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет



System.Console.WriteLine("Данный алгоритм принимает на вход целок число от 1 до 7 \n\t обозначающее день недели и проверяет, является ли этот день выходным.");

Console.Write("Введи число от 1 до 7: ");
int number = Convert.ToInt32(Console.ReadLine());

if (number < 1 | number>7) Console.WriteLine("введена неправильная цифра, введи число от 1 до 7");
else if (number < 6  ) Console.Write($"{number}й день недели является рабочим днем. ");
else Console.Write($"{number}й день недели является выходным днем. ");